| Роль         | Сценарий                                                                                                                                                                  | Статус |
|--------------|---------------------------------------------------------------------------------------------------------------------------------------------------------------------------|--------|
| Общее        | Переход на страницу книг работает, информация о книгах корректно   отображается, для книг с отсутствующей обложкой есть стандартное фото,   информирующее о ее отсутствии | Passed |
|              | Сортировка книг, есть сообщение об отсутствии результатов поиска                                                                                                          | Passed |
|              | Фильтрация книг, есть сообщение об отсутствии результатов поиска                                                                                                          | Passed |
|              | Поиск книг по коду, есть сообщение об отсутствии результатов поиска                                                                                                       | Passed |
|              | Поиск книг по названию и автору, есть сообщение об отсутствии результатов   поиска                                                                                        | Passed |
|              | Сортировка, фильтрация, поиск работают совместно в реальном времени                                                                                                       | Passed |
|              |                                                                                                                                                                           |        |
| Библиотекарь | Книга в наличии удаляется из базы данных                                                                                                                                  | Passed |
|              | Книга, находящаяся на руках у читателя, не может быть удалена, и   отображается сообщение об ошибке                                                                       | Passed |
|              | После удаления книга пропадает из списка книг без необходимости   перезаходить в приложение                                                                               | Passed |
|              |                                                                                                                                                                           |        |
| Читатель     | Читателю видны только книги в наличии                                                                                                                                     | Passed |
